; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=260, out_folder=./training, instance_id=14, seed=2038, goal_proportion=0.03

(define (problem blocksworld-14)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 - object)
 (:init 
    (arm-empty)
    (clear b63)
    (on b63 b106)
    (on b106 b71)
    (on-table b71)
    (clear b153)
    (on b153 b47)
    (on b47 b251)
    (on b251 b76)
    (on b76 b25)
    (on b25 b164)
    (on b164 b48)
    (on b48 b109)
    (on b109 b200)
    (on b200 b92)
    (on b92 b219)
    (on b219 b155)
    (on b155 b260)
    (on b260 b30)
    (on-table b30)
    (clear b91)
    (on b91 b53)
    (on b53 b42)
    (on b42 b180)
    (on b180 b205)
    (on b205 b259)
    (on b259 b167)
    (on-table b167)
    (clear b211)
    (on b211 b184)
    (on-table b184)
    (clear b187)
    (on b187 b166)
    (on b166 b207)
    (on-table b207)
    (clear b50)
    (on b50 b241)
    (on-table b241)
    (clear b210)
    (on-table b210)
    (clear b154)
    (on b154 b183)
    (on b183 b190)
    (on b190 b247)
    (on-table b247)
    (clear b257)
    (on b257 b72)
    (on-table b72)
    (clear b197)
    (on-table b197)
    (clear b165)
    (on-table b165)
    (clear b58)
    (on b58 b126)
    (on b126 b40)
    (on b40 b182)
    (on b182 b2)
    (on b2 b55)
    (on b55 b162)
    (on-table b162)
    (clear b95)
    (on b95 b213)
    (on b213 b6)
    (on-table b6)
    (clear b161)
    (on b161 b77)
    (on-table b77)
    (clear b158)
    (on b158 b159)
    (on-table b159)
    (clear b134)
    (on-table b134)
    (clear b59)
    (on b59 b123)
    (on b123 b186)
    (on-table b186)
    (clear b12)
    (on b12 b198)
    (on b198 b80)
    (on b80 b82)
    (on b82 b86)
    (on b86 b20)
    (on-table b20)
    (clear b172)
    (on b172 b240)
    (on-table b240)
    (clear b67)
    (on b67 b139)
    (on-table b139)
    (clear b125)
    (on b125 b103)
    (on b103 b29)
    (on b29 b179)
    (on b179 b195)
    (on-table b195)
    (clear b38)
    (on b38 b132)
    (on-table b132)
    (clear b27)
    (on-table b27)
    (clear b52)
    (on b52 b221)
    (on-table b221)
    (clear b151)
    (on b151 b193)
    (on-table b193)
    (clear b215)
    (on-table b215)
    (clear b212)
    (on b212 b163)
    (on b163 b143)
    (on-table b143)
    (clear b51)
    (on b51 b65)
    (on b65 b100)
    (on-table b100)
    (clear b208)
    (on b208 b168)
    (on-table b168)
    (clear b234)
    (on b234 b120)
    (on-table b120)
    (clear b87)
    (on b87 b39)
    (on-table b39)
    (clear b232)
    (on-table b232)
    (clear b174)
    (on b174 b110)
    (on-table b110)
    (clear b14)
    (on b14 b93)
    (on b93 b23)
    (on b23 b101)
    (on b101 b81)
    (on-table b81)
    (clear b79)
    (on b79 b220)
    (on-table b220)
    (clear b104)
    (on b104 b105)
    (on b105 b188)
    (on b188 b13)
    (on-table b13)
    (clear b135)
    (on-table b135)
    (clear b127)
    (on b127 b192)
    (on-table b192)
    (clear b230)
    (on b230 b102)
    (on-table b102)
    (clear b249)
    (on b249 b62)
    (on-table b62)
    (clear b254)
    (on-table b254)
    (clear b60)
    (on b60 b223)
    (on b223 b84)
    (on b84 b88)
    (on b88 b117)
    (on b117 b114)
    (on b114 b64)
    (on b64 b5)
    (on b5 b33)
    (on-table b33)
    (clear b253)
    (on b253 b130)
    (on b130 b142)
    (on b142 b170)
    (on b170 b173)
    (on-table b173)
    (clear b21)
    (on-table b21)
    (clear b206)
    (on b206 b140)
    (on b140 b32)
    (on-table b32)
    (clear b137)
    (on b137 b136)
    (on b136 b45)
    (on b45 b171)
    (on b171 b224)
    (on b224 b258)
    (on b258 b160)
    (on b160 b231)
    (on b231 b41)
    (on b41 b73)
    (on b73 b99)
    (on b99 b54)
    (on b54 b237)
    (on b237 b9)
    (on-table b9)
    (clear b121)
    (on-table b121)
    (clear b146)
    (on-table b146)
    (clear b203)
    (on b203 b226)
    (on b226 b202)
    (on b202 b116)
    (on-table b116)
    (clear b69)
    (on b69 b178)
    (on b178 b74)
    (on b74 b243)
    (on b243 b66)
    (on b66 b209)
    (on-table b209)
    (clear b68)
    (on b68 b227)
    (on b227 b34)
    (on-table b34)
    (clear b138)
    (on b138 b24)
    (on b24 b238)
    (on-table b238)
    (clear b44)
    (on b44 b148)
    (on b148 b129)
    (on b129 b61)
    (on b61 b115)
    (on b115 b189)
    (on-table b189)
    (clear b16)
    (on b16 b18)
    (on b18 b36)
    (on-table b36)
    (clear b98)
    (on b98 b49)
    (on b49 b4)
    (on b4 b108)
    (on b108 b191)
    (on b191 b255)
    (on b255 b217)
    (on b217 b156)
    (on b156 b133)
    (on-table b133)
    (clear b147)
    (on b147 b239)
    (on b239 b1)
    (on b1 b250)
    (on b250 b169)
    (on b169 b157)
    (on b157 b152)
    (on b152 b113)
    (on b113 b144)
    (on b144 b97)
    (on b97 b150)
    (on b150 b11)
    (on b11 b7)
    (on b7 b185)
    (on-table b185)
    (clear b149)
    (on b149 b107)
    (on b107 b233)
    (on-table b233)
    (clear b194)
    (on b194 b70)
    (on b70 b216)
    (on-table b216)
    (clear b111)
    (on b111 b228)
    (on b228 b119)
    (on b119 b17)
    (on b17 b248)
    (on b248 b201)
    (on b201 b10)
    (on b10 b204)
    (on b204 b28)
    (on-table b28)
    (clear b94)
    (on-table b94)
    (clear b122)
    (on b122 b31)
    (on b31 b196)
    (on b196 b236)
    (on b236 b124)
    (on b124 b75)
    (on b75 b176)
    (on b176 b252)
    (on b252 b177)
    (on b177 b35)
    (on b35 b214)
    (on b214 b222)
    (on b222 b145)
    (on-table b145)
    (clear b225)
    (on b225 b181)
    (on b181 b90)
    (on b90 b246)
    (on b246 b22)
    (on b22 b175)
    (on b175 b235)
    (on b235 b19)
    (on b19 b96)
    (on-table b96)
    (clear b141)
    (on b141 b85)
    (on b85 b218)
    (on-table b218)
    (clear b118)
    (on b118 b199)
    (on b199 b242)
    (on b242 b128)
    (on b128 b256)
    (on b256 b3)
    (on b3 b131)
    (on b131 b112)
    (on b112 b83)
    (on b83 b26)
    (on-table b26)
    (clear b245)
    (on-table b245)
    (clear b78)
    (on b78 b15)
    (on b15 b89)
    (on b89 b43)
    (on b43 b57)
    (on-table b57)
    (clear b229)
    (on b229 b8)
    (on b8 b56)
    (on b56 b37)
    (on b37 b244)
    (on-table b244)
    (clear b46)
    (on-table b46))
 (:goal  (and 
    (clear b2)
    (on b2 b7)
    (on-table b7)
    (clear b1)
    (on b1 b4)
    (on b4 b6)
    (on b6 b3)
    (on-table b3)
    (clear b5)
    (on-table b5))))

; plan
1. (unstack b118 b199)
   deleted: (on b118 b199) (clear b118) (arm-empty)
   added: (holding b118) (clear b199)
   goals met: 0 of 10
2. (putdown b118)
   deleted: (holding b118)
   added: (clear b118) (arm-empty) (on-table b118)
   goals met: 0 of 10
3. (unstack b147 b239)
   deleted: (on b147 b239) (clear b147) (arm-empty)
   added: (holding b147) (clear b239)
   goals met: 0 of 10
4. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 0 of 10
5. (unstack b199 b242)
   deleted: (on b199 b242) (clear b199) (arm-empty)
   added: (holding b199) (clear b242)
   goals met: 0 of 10
6. (putdown b199)
   deleted: (holding b199)
   added: (clear b199) (arm-empty) (on-table b199)
   goals met: 0 of 10
7. (unstack b239 b1)
   deleted: (on b239 b1) (clear b239) (arm-empty)
   added: (holding b239) (clear b1)
   goals met: 1 of 10
8. (putdown b239)
   deleted: (holding b239)
   added: (clear b239) (arm-empty) (on-table b239)
   goals met: 1 of 10
9. (unstack b242 b128)
   deleted: (on b242 b128) (clear b242) (arm-empty)
   added: (holding b242) (clear b128)
   goals met: 1 of 10
10. (putdown b242)
   deleted: (holding b242)
   added: (clear b242) (arm-empty) (on-table b242)
   goals met: 1 of 10
11. (unstack b128 b256)
   deleted: (on b128 b256) (clear b128) (arm-empty)
   added: (holding b128) (clear b256)
   goals met: 1 of 10
12. (putdown b128)
   deleted: (holding b128)
   added: (clear b128) (arm-empty) (on-table b128)
   goals met: 1 of 10
13. (unstack b256 b3)
   deleted: (on b256 b3) (clear b256) (arm-empty)
   added: (holding b256) (clear b3)
   goals met: 1 of 10
14. (putdown b256)
   deleted: (holding b256)
   added: (clear b256) (arm-empty) (on-table b256)
   goals met: 1 of 10
15. (unstack b3 b131)
   deleted: (on b3 b131) (clear b3) (arm-empty)
   added: (holding b3) (clear b131)
   goals met: 1 of 10
16. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 10
17. (unstack b58 b126)
   deleted: (on b58 b126) (clear b58) (arm-empty)
   added: (holding b58) (clear b126)
   goals met: 2 of 10
18. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 2 of 10
19. (unstack b126 b40)
   deleted: (on b126 b40) (clear b126) (arm-empty)
   added: (holding b126) (clear b40)
   goals met: 2 of 10
20. (putdown b126)
   deleted: (holding b126)
   added: (clear b126) (arm-empty) (on-table b126)
   goals met: 2 of 10
21. (unstack b40 b182)
   deleted: (on b40 b182) (clear b40) (arm-empty)
   added: (holding b40) (clear b182)
   goals met: 2 of 10
22. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 2 of 10
23. (unstack b182 b2)
   deleted: (on b182 b2) (clear b182) (arm-empty)
   added: (holding b182) (clear b2)
   goals met: 3 of 10
24. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 3 of 10
25. (unstack b60 b223)
   deleted: (on b60 b223) (clear b60) (arm-empty)
   added: (holding b60) (clear b223)
   goals met: 3 of 10
26. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 3 of 10
27. (unstack b223 b84)
   deleted: (on b223 b84) (clear b223) (arm-empty)
   added: (holding b223) (clear b84)
   goals met: 3 of 10
28. (putdown b223)
   deleted: (holding b223)
   added: (clear b223) (arm-empty) (on-table b223)
   goals met: 3 of 10
29. (unstack b84 b88)
   deleted: (on b84 b88) (clear b84) (arm-empty)
   added: (holding b84) (clear b88)
   goals met: 3 of 10
30. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 3 of 10
31. (unstack b88 b117)
   deleted: (on b88 b117) (clear b88) (arm-empty)
   added: (holding b88) (clear b117)
   goals met: 3 of 10
32. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 3 of 10
33. (unstack b117 b114)
   deleted: (on b117 b114) (clear b117) (arm-empty)
   added: (holding b117) (clear b114)
   goals met: 3 of 10
34. (putdown b117)
   deleted: (holding b117)
   added: (clear b117) (arm-empty) (on-table b117)
   goals met: 3 of 10
35. (unstack b114 b64)
   deleted: (on b114 b64) (clear b114) (arm-empty)
   added: (holding b114) (clear b64)
   goals met: 3 of 10
36. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 3 of 10
37. (unstack b64 b5)
   deleted: (on b64 b5) (clear b64) (arm-empty)
   added: (holding b64) (clear b5)
   goals met: 4 of 10
38. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 4 of 10
39. (unstack b5 b33)
   deleted: (on b5 b33) (clear b5) (arm-empty)
   added: (holding b5) (clear b33)
   goals met: 3 of 10
40. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 10
41. (unstack b95 b213)
   deleted: (on b95 b213) (clear b95) (arm-empty)
   added: (holding b95) (clear b213)
   goals met: 5 of 10
42. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 5 of 10
43. (unstack b213 b6)
   deleted: (on b213 b6) (clear b213) (arm-empty)
   added: (holding b213) (clear b6)
   goals met: 5 of 10
44. (putdown b213)
   deleted: (holding b213)
   added: (clear b213) (arm-empty) (on-table b213)
   goals met: 5 of 10
45. (unstack b98 b49)
   deleted: (on b98 b49) (clear b98) (arm-empty)
   added: (holding b98) (clear b49)
   goals met: 5 of 10
46. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 5 of 10
47. (unstack b49 b4)
   deleted: (on b49 b4) (clear b49) (arm-empty)
   added: (holding b49) (clear b4)
   goals met: 5 of 10
48. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 5 of 10
49. (unstack b1 b250)
   deleted: (on b1 b250) (clear b1) (arm-empty)
   added: (holding b1) (clear b250)
   goals met: 4 of 10
50. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 6 of 10
51. (unstack b250 b169)
   deleted: (on b250 b169) (clear b250) (arm-empty)
   added: (holding b250) (clear b169)
   goals met: 6 of 10
52. (putdown b250)
   deleted: (holding b250)
   added: (clear b250) (arm-empty) (on-table b250)
   goals met: 6 of 10
53. (unstack b169 b157)
   deleted: (on b169 b157) (clear b169) (arm-empty)
   added: (holding b169) (clear b157)
   goals met: 6 of 10
54. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 6 of 10
55. (unstack b157 b152)
   deleted: (on b157 b152) (clear b157) (arm-empty)
   added: (holding b157) (clear b152)
   goals met: 6 of 10
56. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 6 of 10
57. (unstack b152 b113)
   deleted: (on b152 b113) (clear b152) (arm-empty)
   added: (holding b152) (clear b113)
   goals met: 6 of 10
58. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 6 of 10
59. (unstack b113 b144)
   deleted: (on b113 b144) (clear b113) (arm-empty)
   added: (holding b113) (clear b144)
   goals met: 6 of 10
60. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 6 of 10
61. (unstack b144 b97)
   deleted: (on b144 b97) (clear b144) (arm-empty)
   added: (holding b144) (clear b97)
   goals met: 6 of 10
62. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 6 of 10
63. (unstack b97 b150)
   deleted: (on b97 b150) (clear b97) (arm-empty)
   added: (holding b97) (clear b150)
   goals met: 6 of 10
64. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 6 of 10
65. (unstack b150 b11)
   deleted: (on b150 b11) (clear b150) (arm-empty)
   added: (holding b150) (clear b11)
   goals met: 6 of 10
66. (putdown b150)
   deleted: (holding b150)
   added: (clear b150) (arm-empty) (on-table b150)
   goals met: 6 of 10
67. (unstack b11 b7)
   deleted: (on b11 b7) (clear b11) (arm-empty)
   added: (holding b11) (clear b7)
   goals met: 6 of 10
68. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 6 of 10
69. (unstack b7 b185)
   deleted: (on b7 b185) (clear b7) (arm-empty)
   added: (holding b7) (clear b185)
   goals met: 6 of 10
70. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 7 of 10
71. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 10
72. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 8 of 10
73. (unstack b2 b55)
   deleted: (on b2 b55) (clear b2) (arm-empty)
   added: (holding b2) (clear b55)
   goals met: 7 of 10
74. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 9 of 10
75. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 7 of 10
76. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 8 of 10
77. (unstack b4 b108)
   deleted: (on b4 b108) (clear b4) (arm-empty)
   added: (holding b4) (clear b108)
   goals met: 8 of 10
78. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 9 of 10
79. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 8 of 10
80. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 10 of 10
